xuos/xiuos/board/stm32f407-st-discovery/third_party_driver/sdio/sdio_sd.c
  errorstatus = CmdResp1Error(SD_CMD_SET_BLOCKLEN);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }

  /*!< Send CMD55 APP_CMD with argument as card's RCA */
  SDIO_CmdInitStructure.SDIO_Argument = (uint32_t) RCA << 16; 
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_APP_CMD;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_APP_CMD);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }
  /*set recv data register*/
  SDIO_DataInitStructure.SDIO_DataTimeOut = SD_DATATIMEOUT;
  SDIO_DataInitStructure.SDIO_DataLength = 8;  //8byte,64 bit
  SDIO_DataInitStructure.SDIO_DataBlockSize = SDIO_DataBlockSize_8b  ;  //block size 8 byte 
  SDIO_DataInitStructure.SDIO_TransferDir = SDIO_TransferDir_ToSDIO;
  SDIO_DataInitStructure.SDIO_TransferMode = SDIO_TransferMode_Block;
  SDIO_DataInitStructure.SDIO_DPSM = SDIO_DPSM_Enable;
  SDIO_DataConfig(&SDIO_DataInitStructure);			 

  /*!< Send ACMD51 SD_APP_SEND_SCR with argument as 0 */
  SDIO_CmdInitStructure.SDIO_Argument = 0x0;
  SDIO_CmdInitStructure.SDIO_CmdIndex = SD_CMD_SD_APP_SEND_SCR;
  SDIO_CmdInitStructure.SDIO_Response = SDIO_Response_Short;  //r1
  SDIO_CmdInitStructure.SDIO_Wait = SDIO_Wait_No;
  SDIO_CmdInitStructure.SDIO_CPSM = SDIO_CPSM_Enable;
  SDIO_SendCommand(&SDIO_CmdInitStructure);

  errorstatus = CmdResp1Error(SD_CMD_SD_APP_SEND_SCR);

  if (errorstatus != SD_OK)
  {
    return(errorstatus);
  }			   
   
  while (!(SDIO->STA & (SDIO_FLAG_RXOVERR | SDIO_FLAG_DCRCFAIL | SDIO_FLAG_DTIMEOUT | SDIO_FLAG_DBCKEND| SDIO_FLAG_STBITERR)))
  {	   		
    if (SDIO_GetFlagStatus(SDIO_FLAG_RXDAVL) != RESET)	//check the data 
	  {  	
     	*(tempscr + index) = SDIO_ReadData();  
			index++;	

	   //add check   		     
		 if(index > 1 ) 
				break;
    }
  }

  if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
    errorstatus = SD_DATA_TIMEOUT;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
    errorstatus = SD_DATA_CRC_FAIL;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
    errorstatus = SD_RX_OVERRUN;
    return(errorstatus);
  }
  else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
  {
    SDIO_ClearFlag(SDIO_FLAG_STBITERR);
    errorstatus = SD_START_BIT_ERR;
    return(errorstatus);
  }

  /*!< Clear all the static flags */
  SDIO_ClearFlag(SDIO_STATIC_FLAGS);

  *(pscr + 1) = ((tempscr[0] & SD_0TO7BITS) << 24) | ((tempscr[0] & SD_8TO15BITS) << 8) | ((tempscr[0] & SD_16TO23BITS) >> 8) | ((tempscr[0] & SD_24TO31BITS) >> 24);

  *(pscr) = ((tempscr[1] & SD_0TO7BITS) << 24) | ((tempscr[1] & SD_8TO15BITS) << 8) | ((tempscr[1] & SD_16TO23BITS) >> 8) | ((tempscr[1] & SD_24TO31BITS) >> 24);

  return(errorstatus);
}


/**
  * @brief  Converts the number of bytes in power of two and returns the power.
  * @param  NumberOfBytes: number of bytes.
  * @retval None
  */
uint8_t convert_from_bytes_to_power_of_two(uint16_t NumberOfBytes)
{
  uint8_t count = 0;

  while (NumberOfBytes != 1)
  {
    NumberOfBytes >>= 1;
    count++;
  }
  return(count);
}





void SD_ProcessDMAIRQ()
{
	#ifdef SD_SDIO_DMA_STREAM3
	{
		if (DMA2->LISR&SD_SDIO_DMA_FLAG_TCIF)
		{
			DMAEndOfTransfer=0x01;
			DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_TCIF | SD_SDIO_DMA_FLAG_FEIF);
		}
	}
	#elif defined SD_SDIO_DMA_STREAM6
	{	
		if (DMA2->HISR&SD_SDIO_DMA_FLAG_TCIF)
		{
			DMAEndOfTransfer=0x01;
			DMA_ClearFlag(SD_SDIO_DMA_STREAM, SD_SDIO_DMA_FLAG_TCIF | SD_SDIO_DMA_FLAG_FEIF);
		}
	}
	#endif
}


SD_Error SD_ProcessIRQSrc(void)
{	
	if (SDIO_GetFlagStatus(SDIO_FLAG_DTIMEOUT) != RESET)
	{
	  SDIO_ClearFlag(SDIO_FLAG_DTIMEOUT);
	  TransferError = SD_DATA_TIMEOUT;
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_DCRCFAIL) != RESET)
	{
	  SDIO_ClearFlag(SDIO_FLAG_DCRCFAIL);
	  TransferError = SD_DATA_CRC_FAIL;
	}
  else if (SDIO_GetFlagStatus(SDIO_FLAG_RXOVERR) != RESET)
	{
	  SDIO_ClearFlag(SDIO_FLAG_RXOVERR);
	  TransferError = SD_RX_OVERRUN;
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_STBITERR) != RESET)
	{
	  SDIO_ClearFlag(SDIO_FLAG_STBITERR);
	  TransferError = SD_START_BIT_ERR;
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_TXUNDERR) != RESET)
	{
	 	SDIO_ClearFlag(SDIO_FLAG_TXUNDERR);
	}
	else if (SDIO_GetFlagStatus(SDIO_FLAG_DATAEND) != RESET)
	{
	 	TransferError = SD_OK;
		TransferEnd = 1;
		SDIO_ClearFlag(SDIO_FLAG_DATAEND);
	}
	SDIO_ClearITPendingBit(SDIO_IT_RXOVERR|SDIO_IT_DTIMEOUT|SDIO_IT_DCRCFAIL|SDIO_IT_DATAEND|SDIO_IT_TXUNDERR|SDIO_IT_STBITERR); //清中断
	SDIO_ITConfig(SDIO_IT_RXOVERR|SDIO_IT_DTIMEOUT|SDIO_IT_DCRCFAIL|SDIO_IT_DATAEND|SDIO_IT_TXUNDERR|SDIO_IT_STBITERR, DISABLE);
	return(TransferError);
}

		   
/*****************************END OF FILE*****************************/

/*******************************************************************************
* Function Name  : SD_GetCapacity
* Description    : get sd card capacity
* Input          : None
* Output         : None
* Return         : u32 capacity 
*                   0： error 
*******************************************************************************/
uint32_t SD_GetCapacity(void)
{
    return SDCardInfo.CardCapacity;
}


void SDIO_IRQHandler(int irq_num, void *arg)
{	
  SD_ProcessIRQSrc();
}
DECLARE_HW_IRQ(SDIO_IRQn, SDIO_IRQHandler, NONE);

void DMA2_Stream3_IRQHandler(int irq_num, void *arg)
{
  SD_ProcessDMAIRQ();
}
DECLARE_HW_IRQ(DMA2_Stream3_IRQn, DMA2_Stream3_IRQHandler, NONE);

void DMA2_Stream6_IRQHandler(int irq_num, void *arg)
{
  SD_ProcessDMAIRQ();
}
DECLARE_HW_IRQ(DMA2_Stream6_IRQn, DMA2_Stream6_IRQHandler, NONE);


